jj11hh/ch554_sdcc/projects/cdc_nrf24l01_send/main.c
    }
}

void GPIOSetup( void ) {
    // Pins:
    // LED:     P3.4 Output
    // IRQ:     P3.2 Input & Interrupt
    // MOSI:    P1.5 Output
    // MISO:    P1.6 Input
    // SCK:     P1.7 Output
    // CE:      P3.1 Output
    // CSN:     P3.0 Output

    P3_DIR_PU = 0b11111011;
    P3_MOD_OC = 0b00000000;
    // Port3: 8 7 6 5 4 3 2 1 0
    // In:                0
    // Out:   1 1 1 1 1 1   1 1

    P1_DIR_PU = 0b110111111;
    P1_MOD_OC = 0b000000000;
    // Port1: 8 7 6 5 4 3 2 1 0
    // In:        0
    // Out:   1 1   1 1 1 1 1 1

    LED = 0; // LED On
    CE = 0;  // Disable TX/RX
    CSN = 1;

    mDelaymS(20);
}

void USBCDC_SendBytes(const char *buf, uint8_t len) {
    // write upload endpoint
    while (UpPoint2_Busy);
    memcpy(Ep2Buffer + MAX_PACKET_SIZE, buf, len);
    UEP2_T_LEN = len; // Pre-use send length must be cleared
    UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK; // Answer ACK
    UpPoint2_Busy = 1;
}

void nRF24_Config( void ){
    nRF24_CE_L();

    nRF24_Init();
    // 关闭所有通道自动确认
    nRF24_WriteReg(nRF24_REG_EN_AA, 0x00);
    // 5 bytes 地址
    nRF24_WriteReg(nRF24_REG_SETUP_AW, 0b11);
    // 关闭自动重发
    nRF24_WriteReg(nRF24_REG_SETUP_RETR, 0x00);
    // 2.440Ghz
    nRF24_WriteReg(nRF24_REG_RF_CH, 40);
    // 250kbps, 0dBm
    nRF24_WriteReg(nRF24_REG_RF_SETUP, 0b00100011);
    // 设置发送地址
    nRF24_CSN_L();
    nRF24_LL_RW(nRF24_CMD_W_REGISTER | nRF24_REG_TX_ADDR);
    nRF24_LL_RW(0x34);
    nRF24_LL_RW(0x43);
    nRF24_LL_RW(0x10);
    nRF24_LL_RW(0x10);
    nRF24_LL_RW(0x01);
    nRF24_CSN_H();

    // 数据长度 22 bytes
    nRF24_WriteReg(nRF24_REG_RX_PW_P0, 22);

    nRF24_ClearIRQFlags();

    // 16bit CRC, 发送模式, 上电
    nRF24_WriteReg(nRF24_REG_CONFIG,
        nRF24_CONFIG_EN_CRC | nRF24_CONFIG_CRCO);

/*
    nRF24_Init();
    nRF24_DisableAA(0xFF);
    nRF24_SetRFChannel(40);
    nRF24_SetDataRate(nRF24_DR_250kbps);
    nRF24_SetCRCScheme(nRF24_CRC_2byte);
    nRF24_SetAddrWidth(5);
    __code uint8_t nRF24_ADDR0[] = {0x34, 0x43, 0x10, 0x10, 0x01};
    nRF24_SetAddr(nRF24_PIPE0, nRF24_ADDR0);
    nRF24_SetRXPipe(nRF24_PIPE0, nRF24_AA_OFF, 22);
    nRF24_SetOperationalMode(nRF24_MODE_RX);
    nRF24_SetPowerMode(nRF24_PWR_UP);
*/

    // 稍等
    mDelaymS(100);
}

//主函数
void main( void )
{
    __xdata uint32_t Uart_Timeout = 0;
    __xdata uint8_t recievedData[MAX_PACKET_SIZE] ="";
    uint8_t dataRecievedCopFlag = 0 ; 
    uint8_t buffer[32] = "Hello\r\n";
    CfgFsys( );                                                           // CH559 clock selection configuration
    mDelaymS(5);                                                          // Modify the main frequency and wait for the internal crystal to stabilize, which must be added
    mInitSTDIO( );                                                        // Serial port 0, can be used for debugging
    GPIOSetup();
    nRF24_Config();

#ifdef DE_PRINTF
    printf("start ...\n");
#endif
    //USBDeviceCfg();
    //USBDeviceEndPointCfg();                                               // Endpoint configuration
    //USBDeviceIntCfg();                                                    //Interrupt initialization
    UEP0_T_LEN = 0;
    UEP1_T_LEN = 0;                                                       //Pre-use send length must be cleared
    UEP2_T_LEN = 0;                                                       //Pre-use send length must be cleared

    uint8_t status;

    while(1)
    {
        nRF24_CE_L();
        nRF24_WritePayload(buffer, 22);
        nRF24_WriteReg(nRF24_REG_STATUS, 0x7e);
        nRF24_CE_H();

        mDelaymS(20);

        nRF24_CE_L();
        nRF24_ClearIRQFlags();
        nRF24_FlushTX();

        mDelaymS(500);

        LED = ! LED;
    }
}
